# WallTopExtensionDistParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..WallTopExtensionDistParam Property
ParameterTypeId Class See Also
---
"Top Extension Distance"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId WallTopExtensionDistParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WallTopExtensionDistParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ WallTopExtensionDistParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace